SubModel/CFDEMInterFoamIB-main/tutorial/single_sphere/CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(x1|x2|walls)"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    z2
    {
        type            totalPressure;
        p0              uniform 0;
    }

    // x2
    // {
    //     type            totalPressure;
    //     p0              uniform 0;
    // }

}

// ************************************************************************* //
